#+PROPERTY: NAME John Doe
* 1a
  :PROPERTIES:
  :lettergrade: B
  :END:
* 1b
  :PROPERTIES:
  :lettergrade: A
  :END:
* 2
  :PROPERTIES:
  :lettergrade: B
  :END:
Here is my solution
#+BEGIN_SRC python
print 4
#+END_SRC

#+RESULTS:
: 4

* 3
  :PROPERTIES:
  :lettergrade: B
  :END:
